Revit 2027 API
BaseExportOptions.GetExportLayerTable Method
 Gets the layer table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLayerTable GetExportLayerTable()
Public Function GetExportLayerTable As ExportLayerTable
public:
ExportLayerTable^ GetExportLayerTable()
member GetExportLayerTable : unit -> ExportLayerTable
Return Value
ExportLayerTable
 The layer table.
See Also
Reference
BaseExportOptions Class
Autodesk.Revit.DB Namespace